### Assignment 4- Part 1

#### Solution 1.B.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
from urllib.request import urlopen
from bs4 import BeautifulSoup

In [3]:
url = " http://eecs.qmul.ac.uk/~emmanouilb/income_table.html"
html = urlopen(url)

In [4]:
soup = BeautifulSoup(html, 'lxml')
print(type(soup))

<class 'bs4.BeautifulSoup'>

In [5]:
text = soup.get_text()
print(soup.text)

ECS766P Data Mining - Week 10
The below table contains income data per country; the same table was used for the Week 3 lab.

Region
Age
Income
Online Shopper


India
49
86400
No


Brazil
32
57600
Yes


USA
35
64800
No


Brazil
43
73200
No


USA
45

Yes


India
40
69600
Yes


Brazil

62400
No


India
53
94800
Yes


USA
55
99600
No


India
42
80400
Yes

In [6]:
rows = soup.find_all('tr')  # the 'tr' tag in html denotes a table row
print(rows[:10])

[<tr><th title="Field #1">Region</th>
<th title="Field #2">Age</th>
<th title="Field #3">Income</th>
<th title="Field #4">Online Shopper</th>
</tr>, <tr>
<td>India</td>
<td align="right">49</td>
<td align="right">86400</td>
<td>No</td>
</tr>, <tr>
<td>Brazil</td>
<td align="right">32</td>
<td align="right">57600</td>
<td>Yes</td>
</tr>, <tr>
<td>USA</td>
<td align="right">35</td>
<td align="right">64800</td>
<td>No</td>
</tr>, <tr>
<td>Brazil</td>
<td align="right">43</td>
<td align="right">73200</td>
<td>No</td>
</tr>, <tr>
<td>USA</td>
<td align="right">45</td>
<td align="right"></td>
<td>Yes</td>
</tr>, <tr>
<td>India</td>
<td align="right">40</td>
<td align="right">69600</td>
<td>Yes</td>
</tr>, <tr>
<td>Brazil</td>
<td align="right"></td>
<td align="right">62400</td>
<td>No</td>
</tr>, <tr>
<td>India</td>
<td align="right">53</td>
<td align="right">94800</td>
<td>Yes</td>
</tr>, <tr>
<td>USA</td>
<td align="right">55</td>
<td align="right">99600</td>
<td>No</td>
</tr>]

In [7]:
for row in rows:
    row_td = row.find_all('td')  # the 'td' tag in html code denotes a table cell
    print(row_td)
type(row_td)

[]
[<td>India</td>, <td align="right">49</td>, <td align="right">86400</td>, <td>No</td>]
[<td>Brazil</td>, <td align="right">32</td>, <td align="right">57600</td>, <td>Yes</td>]
[<td>USA</td>, <td align="right">35</td>, <td align="right">64800</td>, <td>No</td>]
[<td>Brazil</td>, <td align="right">43</td>, <td align="right">73200</td>, <td>No</td>]
[<td>USA</td>, <td align="right">45</td>, <td align="right"></td>, <td>Yes</td>]
[<td>India</td>, <td align="right">40</td>, <td align="right">69600</td>, <td>Yes</td>]
[<td>Brazil</td>, <td align="right"></td>, <td align="right">62400</td>, <td>No</td>]
[<td>India</td>, <td align="right">53</td>, <td align="right">94800</td>, <td>Yes</td>]
[<td>USA</td>, <td align="right">55</td>, <td align="right">99600</td>, <td>No</td>]
[<td>India</td>, <td align="right">42</td>, <td align="right">80400</td>, <td>Yes</td>]

bs4.element.ResultSet

In [8]:
# Create an empty list where the table header will be stored
header_list = []

# Find the 'th' html tags which denote table header
col_labels = soup.find_all('th')
col_str = str(col_labels)
cleantext_header = BeautifulSoup(col_str, "lxml").get_text()  # extract the text without HTML tags
header_list.append(cleantext_header) # Add the clean table header to the list

print(header_list)

['[Region, Age, Income, Online Shopper]']

In [9]:
# Create an empty list where the table will be stored
table_list = []

# For every row in the table, find each cell element and add it to the list
for row in rows:
    row_td = row.find_all('td')
    row_cells = str(row_td)
    row_cleantext = BeautifulSoup(row_cells, "lxml").get_text()  # extract the text without HTML tags
    table_list.append(row_cleantext)  # Add the clean table row to the list
    
print(table_list)

['[]', '[India, 49, 86400, No]', '[Brazil, 32, 57600, Yes]', '[USA, 35, 64800, No]', '[Brazil, 43, 73200, No]', '[USA, 45, , Yes]', '[India, 40, 69600, Yes]', '[Brazil, , 62400, No]', '[India, 53, 94800, Yes]', '[USA, 55, 99600, No]', '[India, 42, 80400, Yes]']

In [10]:
df_header = pd.DataFrame(header_list)
df_header.head()

                                       0
0  [Region, Age, Income, Online Shopper]

In [11]:
df_header2 = df_header[0].str.split(',', expand=True)
df_header2.head()

         0     1        2                 3
0  [Region   Age   Income   Online Shopper]

In [12]:
df_table = pd.DataFrame(table_list)
df_table2 = df_table[0].str.split(',', expand=True)
df_table2.head(10)

         0     1       2      3
0       []  None    None   None
1   [India    49   86400    No]
2  [Brazil    32   57600   Yes]
3     [USA    35   64800    No]
4  [Brazil    43   73200    No]
5     [USA    45           Yes]
6   [India    40   69600   Yes]
7  [Brazil         62400    No]
8   [India    53   94800   Yes]
9     [USA    55   99600    No]

In [13]:
# Remove uneccesary characters
df_table2[0] = df_table2[0].str.strip('[')
df_table2[0] = df_table2[0].str.strip(']')
df_table2[3] = df_table2[3].str.strip(']')

# Remove all rows with any missing values
df_table3 = df_table2.dropna(axis=0, how='any')

df_table3.head(20)

         0    1       2     3
1    India   49   86400    No
2   Brazil   32   57600   Yes
3      USA   35   64800    No
4   Brazil   43   73200    No
5      USA   45           Yes
6    India   40   69600   Yes
7   Brazil        62400    No
8    India   53   94800   Yes
9      USA   55   99600    No
10   India   42   80400   Yes

In [14]:
#  Remove uneccessary characters from the header
df_header2[0] = df_header2[0].str.strip('[')
df_header2[3] = df_header2[3].str.strip(']')

# Concatenate the two dataframes
frames = [df_header2, df_table3]
df = pd.concat(frames)

df2 = df.rename(columns=df.iloc[0]) #Assign the first row to be the dataframe header
df3 = df2.drop(df2.index[0]) #Drop the replicated header from the first row of the dataframe

df3.head(10)

    Region  Age  Income  Online Shopper
1    India   49   86400              No
2   Brazil   32   57600             Yes
3      USA   35   64800              No
4   Brazil   43   73200              No
5      USA   45                     Yes
6    India   40   69600             Yes
7   Brazil        62400              No
8    India   53   94800             Yes
9      USA   55   99600              No
10   India   42   80400             Yes